Revit 2026 API

# HubGetHubConnectorManager Method

---

Retrieves the ConnectorManager of the Hub.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ConnectorManager GetHubConnectorManager()
```
```vb
Public Function GetHubConnectorManager As ConnectorManager
```
```cpp
public:
ConnectorManager^ GetHubConnectorManager()
```
```fsharp
member GetHubConnectorManager : unit -> ConnectorManager
```

#### Return Value

ConnectorManager The ConnectorManager.

The ConnectorManager provides information about elements connected via the Hub.

#### Reference

Hub Class

Autodesk.Revit.DB.Structure Namespace